# Решение задач проекта CODEFORSES, Задача 59A
#
# (C) 2021 Артур Ще, Москва, Россия
# Released under GNU Public License (GPL)
# email [email protected]
# -----------------------------------------------------------

'''
A. Почти счастливое число
ограничение по времени на тест2 seconds
ограничение по памяти на тест256 megabytes
вводстандартный ввод
выводстандартный вывод
Петя любит счастливые числа. Всем известно, что счастливыми являются положительные целые числа, в десятичной
записи которых содержатся только счастливые цифры 4 и 7. Например, числа 47, 744, 4 являются счастливыми,
а 5, 17, 467 — не являются.

К сожалению, не все числа счастливые. Петя называет число почти счастливым, если количество счастливых 
цифр в нем — счастливое число. Ему интересно, является ли число n почти счастливым.

Входные данные
В единственной строке задано целое число n (1 ≤ n ≤ 10^18).

Пожалуйста, не используйте спецификатор %lld для чтения или записи 64-битных чисел на С++.
Рекомендуется использовать потоки cin, cout или спецификатор %I64d.

Выходные данные
В единственной строке выведите «YES», если число n — почти счастливое, и «NO» в противном случае (без кавычек).
'''

from datetime import datetime
import time
start_time = datetime.now()
import functools
from itertools import *
from collections import Counter
import random
import math

z=input()
c47 = 0
for q in z:
    if int(q) == 4 or int(q) == 7:
        c47=c47+1
b = [4,7]
if c47 in b:
    print('YES')
else:
    print('NO')

#print(ANS,'   TIME:',datetime.now() - start_time)